
  #### Terraform Plan Validate All 📖: `success`
  Plan File: `tmp_plan/envs-shared.plan`

  <details><summary>Show Plan</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_bigquery_dataset.billing_dataset will be created
  + resource "google_bigquery_dataset" "billing_dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "billing_data"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + friendly_name              = "GCP Billing Data"
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + labels                     = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "northamerica-northeast2"
      + max_time_travel_hours      = (known after apply)
      + project                    = (known after apply)
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + dataset {
              + target_types = (known after apply)

              + dataset {
                  + dataset_id = (known after apply)
                  + project_id = (known after apply)
                }
            }

          + routine {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + routine_id = (known after apply)
            }

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # google_folder.common will be created
  + resource "google_folder" "common" {
      + create_time     = (known after apply)
      + display_name    = "fldr-common1"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "folders/676704635797"
    }

  # google_folder.network will be created
  + resource "google_folder" "network" {
      + create_time     = (known after apply)
      + display_name    = "fldr-network1"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "folders/676704635797"
    }

  # google_folder_iam_audit_config.folder_config[0] will be created
  + resource "google_folder_iam_audit_config" "folder_config" {
      + etag    = (known after apply)
      + folder  = "folders/676704635797"
      + id      = (known after apply)
      + service = "allServices"

      + audit_log_config {
          + exempted_members = []
          + log_type         = "ADMIN_READ"
        }
    }

  # google_organization_iam_member.billing_viewer will be created
  + resource "google_organization_iam_member" "billing_viewer" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:gcp-billing-data@kubeshot.com"
      + org_id = "252632484771"
      + role   = "roles/billing.viewer"
    }

  # google_project_iam_member.audit_log_bq_data_viewer will be created
  + resource "google_project_iam_member" "audit_log_bq_data_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-audit-data@kubeshot.com"
      + project = (known after apply)
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.audit_log_bq_user will be created
  + resource "google_project_iam_member" "audit_log_bq_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-audit-data@kubeshot.com"
      + project = (known after apply)
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.audit_log_logging_viewer will be created
  + resource "google_project_iam_member" "audit_log_logging_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-audit-data@kubeshot.com"
      + project = (known after apply)
      + role    = "roles/logging.viewer"
    }

  # google_project_iam_member.billing_bq_user will be created
  + resource "google_project_iam_member" "billing_bq_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-billing-data@kubeshot.com"
      + project = (known after apply)
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.billing_bq_viewer will be created
  + resource "google_project_iam_member" "billing_bq_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-billing-data@kubeshot.com"
      + project = (known after apply)
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.network_sa_base["roles/compute.instanceAdmin"] will be created
  + resource "google_project_iam_member" "network_sa_base" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-terraform-net@prj-b-seed-ebef-07bc.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/compute.instanceAdmin"
    }

  # google_project_iam_member.network_sa_base["roles/iam.serviceAccountAdmin"] will be created
  + resource "google_project_iam_member" "network_sa_base" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-terraform-net@prj-b-seed-ebef-07bc.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountAdmin"
    }

  # google_project_iam_member.network_sa_base["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "network_sa_base" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-terraform-net@prj-b-seed-ebef-07bc.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.network_sa_base["roles/resourcemanager.projectIamAdmin"] will be created
  + resource "google_project_iam_member" "network_sa_base" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-terraform-net@prj-b-seed-ebef-07bc.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # google_project_iam_member.project_scc_default_service_account["roles/artifactregistry.writer"] will be created
  + resource "google_project_iam_member" "project_scc_default_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/artifactregistry.writer"
    }

  # google_project_iam_member.project_scc_default_service_account["roles/cloudfunctions.serviceAgent"] will be created
  + resource "google_project_iam_member" "project_scc_default_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/cloudfunctions.serviceAgent"
    }

  # google_project_iam_member.project_scc_default_service_account["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "project_scc_default_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.project_scc_default_service_account["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "project_scc_default_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.objectViewer"
    }

  # google_pubsub_subscription.scc_notification_subscription will be created
  + resource "google_pubsub_subscription" "scc_notification_subscription" {
      + ack_deadline_seconds       = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "sub-scc-notification"
      + project                    = (known after apply)
      + topic                      = "top-scc-notification"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # google_pubsub_topic.scc_notification_topic will be created
  + resource "google_pubsub_topic" "scc_notification_topic" {
      + id      = (known after apply)
      + name    = "top-scc-notification"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_scc_notification_config.scc_notification_config will be created
  + resource "google_scc_notification_config" "scc_notification_config" {
      + config_id       = (known after apply)
      + description     = "SCC Notification for all active findings"
      + id              = (known after apply)
      + name            = (known after apply)
      + organization    = "252632484771"
      + pubsub_topic    = (known after apply)
      + service_account = (known after apply)

      + streaming_config {
          + filter = "state = \"ACTIVE\""
        }
    }

  # google_tags_tag_binding.bootstrap_folder will be created
  + resource "google_tags_tag_binding" "bootstrap_folder" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = "//cloudresourcemanager.googleapis.com/folders/650805552440"
      + tag_value = (known after apply)
    }

  # google_tags_tag_binding.common_folder will be created
  + resource "google_tags_tag_binding" "common_folder" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = (known after apply)
    }

  # google_tags_tag_binding.network_folder will be created
  + resource "google_tags_tag_binding" "network_folder" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = (known after apply)
    }

  # google_tags_tag_key.tag_keys["environment"] will be created
  + resource "google_tags_tag_key" "tag_keys" {
      + create_time     = (known after apply)
      + description     = "Environment identification"
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = "organizations/252632484771"
      + short_name      = (known after apply)
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_bootstrap"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "bootstrap"
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_development"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "development"
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_identity"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "identity"
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_management"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "management"
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_nonproduction"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "nonproduction"
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_production"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "production"
      + update_time     = (known after apply)
    }

  # random_string.scc_notification_key_suffix will be created
  + resource "random_string" "scc_notification_key_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.tag_key_suffix will be created
  + resource "random_string" "tag_key_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # time_sleep.wait_logs_export will be created
  + resource "time_sleep" "wait_logs_export" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.cai_monitoring.data.archive_file.function_source_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "function_source_zip" {
      + excludes            = [
          + "package-lock.json",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/cai-monitoring/cai_monitoring.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/cai-monitoring/function-source/"
      + type                = "zip"
    }

  # module.cai_monitoring.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.cai_monitoring.data.google_storage_project_service_account.gcs_sa will be read during apply
  # (config refers to values not yet known)
 <= data "google_storage_project_service_account" "gcs_sa" {
      + email_address = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + project       = (known after apply)
    }

  # module.cai_monitoring.google_artifact_registry_repository.cloudfunction will be created
  + resource "google_artifact_registry_repository" "cloudfunction" {
      + create_time   = (known after apply)
      + description   = "This repo stores de image of the cloud function."
      + format        = "DOCKER"
      + id            = (known after apply)
      + kms_key_name  = (known after apply)
      + location      = "northamerica-northeast1"
      + mode          = "STANDARD_REPOSITORY"
      + name          = (known after apply)
      + project       = (known after apply)
      + repository_id = (known after apply)
      + update_time   = (known after apply)
    }

  # module.cai_monitoring.google_cloud_asset_organization_feed.organization_feed will be created
  + resource "google_cloud_asset_organization_feed" "organization_feed" {
      + asset_types     = [
          + ".*",
        ]
      + billing_project = (known after apply)
      + content_type    = "IAM_POLICY"
      + feed_id         = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + org_id          = "252632484771"

      + feed_output_config {
          + pubsub_destination {
              + topic = (known after apply)
            }
        }
    }

  # module.cai_monitoring.google_kms_crypto_key_iam_member.encrypter_decrypter["artifactregistry"] will be created
  + resource "google_kms_crypto_key_iam_member" "encrypter_decrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cai_monitoring.google_kms_crypto_key_iam_member.encrypter_decrypter["cloudfunctions"] will be created
  + resource "google_kms_crypto_key_iam_member" "encrypter_decrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cai_monitoring.google_kms_crypto_key_iam_member.encrypter_decrypter["pubsub"] will be created
  + resource "google_kms_crypto_key_iam_member" "encrypter_decrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cai_monitoring.google_kms_crypto_key_iam_member.encrypter_decrypter["storage"] will be created
  + resource "google_kms_crypto_key_iam_member" "encrypter_decrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cai_monitoring.google_organization_iam_member.cloudfunction_findings_editor will be created
  + resource "google_organization_iam_member" "cloudfunction_findings_editor" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "252632484771"
      + role   = "roles/securitycenter.findingsEditor"
    }

  # module.cai_monitoring.google_project_iam_member.cloudfunction_iam["roles/eventarc.eventReceiver"] will be created
  + resource "google_project_iam_member" "cloudfunction_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/eventarc.eventReceiver"
    }

  # module.cai_monitoring.google_project_iam_member.cloudfunction_iam["roles/pubsub.publisher"] will be created
  + resource "google_project_iam_member" "cloudfunction_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
    }

  # module.cai_monitoring.google_project_iam_member.cloudfunction_iam["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "cloudfunction_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/run.invoker"
    }

  # module.cai_monitoring.google_project_service.services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "artifactregistry.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["cloudasset.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudasset.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudbuild.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["cloudfunctions.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudfunctions.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["eventarc.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "eventarc.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "pubsub.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["run.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "run.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["storage.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "storage.googleapis.com"
    }

  # module.cai_monitoring.google_project_service_identity.service_sa["artifactregistry"] will be created
  + resource "google_project_service_identity" "service_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + project = (known after apply)
      + service = "artifactregistry.googleapis.com"
    }

  # module.cai_monitoring.google_project_service_identity.service_sa["cloudfunctions"] will be created
  + resource "google_project_service_identity" "service_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + project = (known after apply)
      + service = "cloudfunctions.googleapis.com"
    }

  # module.cai_monitoring.google_project_service_identity.service_sa["pubsub"] will be created
  + resource "google_project_service_identity" "service_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + project = (known after apply)
      + service = "pubsub.googleapis.com"
    }

  # module.cai_monitoring.google_scc_source.cai_monitoring will be created
  + resource "google_scc_source" "cai_monitoring" {
      + description  = "SCC Finding Source for caiMonitoring Cloud Functions."
      + display_name = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + organization = "252632484771"
    }

  # module.cai_monitoring.google_service_account.cloudfunction will be created
  + resource "google_service_account" "cloudfunction" {
      + account_id = "cai-monitoring"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.cai_monitoring.google_storage_bucket_object.cf_cai_source_zip will be created
  + resource "google_storage_bucket_object" "cf_cai_source_zip" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "../../modules/cai-monitoring/cai_monitoring.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "../../modules/cai-monitoring/cai_monitoring.zip"
      + storage_class  = (known after apply)
    }

  # module.cai_monitoring.random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.cai_monitoring.time_sleep.wait_for_bucket will be created
  + resource "time_sleep" "wait_for_bucket" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.cai_monitoring.time_sleep.wait_kms_iam will be created
  + resource "time_sleep" "wait_kms_iam" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

  # module.domain_restricted_contacts.google_folder_organization_policy.folder_policy_list_allow_values[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_list_allow_values" {
      + constraint  = "constraints/essentialcontacts.allowedContactDomains"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "@kubeshot.com",
                ]
            }
        }
    }

  # module.kms.google_kms_crypto_key.key[0] will be created
  + resource "google_kms_crypto_key" "key" {
      + destroy_scheduled_duration = (known after apply)
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = (known after apply)
      + name                       = "key-cai-monitoring"
      + purpose                    = "ENCRYPT_DECRYPT"
      + rotation_period            = "7776000s"

      + version_template {
          + algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION"
          + protection_level = "SOFTWARE"
        }
    }

  # module.kms.google_kms_key_ring.key_ring will be created
  + resource "google_kms_key_ring" "key_ring" {
      + id       = (known after apply)
      + location = "northamerica-northeast1"
      + name     = "krg-cai-monitoring"
      + project  = (known after apply)
    }

  # module.logs_export.google_project_iam_member.project_sink_member["resource"] will be created
  + resource "google_project_iam_member" "project_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.logWriter"
    }

  # module.logs_export.google_project_iam_member.project_sink_member_billing[0] will be created
  + resource "google_project_iam_member" "project_sink_member_billing" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.logWriter"
    }

  # module.logs_export.google_pubsub_topic_iam_member.pubsub_sink_member["resource"] will be created
  + resource "google_pubsub_topic_iam_member" "pubsub_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = (known after apply)
    }

  # module.logs_export.google_pubsub_topic_iam_member.pubsub_sink_member_billing[0] will be created
  + resource "google_pubsub_topic_iam_member" "pubsub_sink_member_billing" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = (known after apply)
    }

  # module.logs_export.google_storage_bucket_iam_member.storage_sink_member["resource"] will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # module.logs_export.google_storage_bucket_iam_member.storage_sink_member_billing[0] will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member_billing" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # module.logs_export.random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.logs_export.terracurl_request.exclude_external_logs[0] will be created
  + resource "terracurl_request" "exclude_external_logs" {
      + destroy_retry_interval = 10
      + destroy_timeout        = 10
      + headers                = {
          + "Authorization" = (sensitive value)
          + "Content-Type"  = "application/json"
        }
      + id                     = (known after apply)
      + method                 = "PUT"
      + name                   = "exclude_external_logs"
      + request_body           = (known after apply)
      + request_url_string     = (known after apply)
      + response               = (known after apply)
      + response_codes         = [
          + "200",
        ]
      + retry_interval         = 10
      + status_code            = (known after apply)
      + timeout                = 10
      + url                    = (known after apply)
    }

  # module.logs_export.time_sleep.wait_sa_iam_membership will be created
  + resource "time_sleep" "wait_sa_iam_membership" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.org_domain_restricted_sharing.data.google_organization.orgs["kubeshot.com"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_organization" "orgs" {
      + create_time           = (known after apply)
      + directory_customer_id = (known after apply)
      + domain                = "kubeshot.com"
      + id                    = (known after apply)
      + lifecycle_state       = (known after apply)
      + name                  = (known after apply)
      + org_id                = (known after apply)
    }

  # module.org_policies_disable_guest_attribute_access[0].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/compute.disableGuestAttributesAccess"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.org_policies_require_trusted_images[0].google_folder_organization_policy.folder_policy_list_allow_values[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_list_allow_values" {
      + constraint  = "constraints/compute.trustedImageProjects"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "projects/cos-cloud",
                  + "projects/debian-cloud",
                  + "projects/fortigcp-project-001",
                ]
            }
        }
    }

  # module.org_policies_resource_location_constraint[0].google_folder_organization_policy.folder_policy_list_allow_values[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_list_allow_values" {
      + constraint  = "constraints/gcp.resourceLocations"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "global",
                  + "in:canada-locations",
                ]
            }
        }
    }

  # module.org_policies_restrict_protocol_fowarding[0].google_folder_organization_policy.folder_policy_list_allow_values[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_list_allow_values" {
      + constraint  = "constraints/compute.restrictProtocolForwardingCreationForTypes"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "EXTERNAL",
                  + "INTERNAL",
                ]
            }
        }
    }

  # module.org_policies_restricted_loadbalancer_types[0].google_folder_organization_policy.folder_policy_list_allow_values[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_list_allow_values" {
      + constraint  = "constraints/compute.restrictLoadBalancerCreationForTypes"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "EXTERNAL_HTTP_HTTPS",
                  + "EXTERNAL_NETWORK_TCP_UDP",
                  + "INTERNAL_TCP_UDP",
                ]
            }
        }
    }

  # module.org_vm_external_ip_access.google_folder_organization_policy.folder_policy_list_deny_all[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_list_deny_all" {
      + constraint  = "constraints/compute.vmExternalIpAccess"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + deny {
              + all = true
            }
        }
    }

  # module.organization_policies_type_boolean["compute.disableNestedVirtualization"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/compute.disableNestedVirtualization"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.disableSerialPortAccess"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/compute.disableSerialPortAccess"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.disableVpcExternalIpv6"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/compute.disableVpcExternalIpv6"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.requireOsLogin"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/compute.requireOsLogin"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.restrictXpnProjectLienRemoval"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/compute.restrictXpnProjectLienRemoval"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.setNewProjectDefaultToZonalDNSOnly"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/compute.setNewProjectDefaultToZonalDNSOnly"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.skipDefaultNetworkCreation"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/compute.skipDefaultNetworkCreation"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["iam.automaticIamGrantsForDefaultServiceAccounts"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/iam.automaticIamGrantsForDefaultServiceAccounts"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["iam.disableServiceAccountKeyCreation"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/iam.disableServiceAccountKeyCreation"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["iam.disableServiceAccountKeyUpload"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/iam.disableServiceAccountKeyUpload"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["sql.restrictAuthorizedNetworks"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/sql.restrictAuthorizedNetworks"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["sql.restrictPublicIp"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/sql.restrictPublicIp"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["storage.publicAccessPrevention"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/storage.publicAccessPrevention"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["storage.uniformBucketLevelAccess"].google_folder_organization_policy.folder_policy_boolean[0] will be created
  + resource "google_folder_organization_policy" "folder_policy_boolean" {
      + constraint  = "constraints/storage.uniformBucketLevelAccess"
      + etag        = (known after apply)
      + folder      = "676704635797"
      + id          = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.base_network_hub[0].module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.base_network_hub[0].module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01F01C-EC0BAC-DD9482"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.base_network_hub[0].module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01F01C-EC0BAC-DD9482"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-net-hub-base"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "net"
          + "environment"       = "network"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "base"
        }
      + name                = "prj-net-hub-base"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.base_network_hub[0].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.base_network_hub[0].module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = "prj-net-hub-base Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.base_network_hub[0].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.base_network_hub[0].module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.cai_monitoring.module.cloud_function.google_cloudfunctions2_function.function will be created
  + resource "google_cloudfunctions2_function" "function" {
      + description = "Check on the Organization for members (users, groups and service accounts) that contains the IAM roles listed."
      + environment = (known after apply)
      + id          = (known after apply)
      + location    = "northamerica-northeast1"
      + name        = "caiMonitoring"
      + project     = (known after apply)
      + state       = (known after apply)
      + update_time = (known after apply)
      + url         = (known after apply)

      + build_config {
          + build                 = (known after apply)
          + docker_repository     = (known after apply)
          + entry_point           = "caiMonitoring"
          + environment_variables = (known after apply)
          + runtime               = "nodejs20"

          + source {

              + storage_source {
                  + bucket     = (known after apply)
                  + generation = (known after apply)
                  + object     = "../../modules/cai-monitoring/cai_monitoring.zip"
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.pubsub.topic.v1.messagePublished"
          + pubsub_topic          = (known after apply)
          + retry_policy          = "RETRY_POLICY_RETRY"
          + service_account_email = (known after apply)
          + trigger               = (known after apply)
          + trigger_region        = "northamerica-northeast1"
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = "256M"
          + environment_variables            = (known after apply)
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 100
          + max_instance_request_concurrency = (known after apply)
          + min_instance_count               = 1
          + service                          = (known after apply)
          + service_account_email            = (known after apply)
          + timeout_seconds                  = 60
          + uri                              = (known after apply)
        }
    }

  # module.cai_monitoring.module.cloudfunction_source_bucket.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "NORTHAMERICA-NORTHEAST1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + public_access_prevention    = "inherited"
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + autoclass {
          + enabled = false
        }

      + encryption {
          + default_kms_key_name = (known after apply)
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = true
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.cai_monitoring.module.pubsub_cai_feed.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.cai_monitoring.module.pubsub_cai_feed.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.cai_monitoring.module.pubsub_cai_feed.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id           = (known after apply)
      + kms_key_name = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.dns_hub.module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.dns_hub.module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01F01C-EC0BAC-DD9482"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.dns_hub.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01F01C-EC0BAC-DD9482"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-dns-hub"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "net"
          + "environment"       = "network"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + name                = "prj-net-dns"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.dns_hub.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.dns_hub.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = "prj-net-dns Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.dns_hub.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.dns_hub.module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.interconnect.module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.interconnect.module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01F01C-EC0BAC-DD9482"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.interconnect.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01F01C-EC0BAC-DD9482"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-interconnect"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "net"
          + "environment"       = "network"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + name                = "prj-net-interconnect"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.interconnect.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_defa ...
  ```

  </details>
  Output is too long and was truncated. You can read full Plan in <a href="https://github.com/kubeshot/gcp-1-org-repo/actions/runs/13466050260">Actions</a>.<br /><br />
  